codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/Src/main.c

/* Includes ------------------------------------------------------------------*/
#include "stdlib.h"
#include "main.h"
#include <stdio.h>
#include "stdint.h"
#include "stdbool.h"
#include "string.h"
#include "gui/leds.h"
#include "gui/gui.h"
#include "stm32f7xx_it.h"

#define DELAY 0
#define OCTAVADOR 1
#define CHORUS 2
#define PHASER 3
#define WAH 4
#define REVERB 5
#define DISTORSION 6
#define FLANGER 7
#define TREMOLO 8
#define VIBRATO 9
#define EQ 10
#define RINGMOD 11
#define IZQUIERDA 0
#define MENU_1 14
#define MENU_2 15
#define DERECHA 1
#define HOME 2
#define IZQUIERDA_MENU 16
#define DERECHA_MENU 17

//Para dibujar perillas
//EJEMPLO WSLDN4 -> EX03
#include <math.h>
#include "gui/prototipos.h"

/* Global extern variables ---------------------------------------------------*/
#ifndef USE_FULL_ASSERT
uint32_t ErrorCounter = 0;
#endif

/* Enable Features ---------------------------------------------------*/
#ifndef EXTERNAL_WHEEL_ENABLE
#define EXTERNAL_WHEEL_ENABLE	0
#endif

#ifndef	AUDIO_ENABLE
#define AUDIO_ENABLE	1
#endif

#ifndef	SCREEN_ENABLE
#define SCREEN_ENABLE	1
#endif

/* Private function prototypes -----------------------------------------------*/
#if EXTERNAL_WHEEL_ENABLE
ADC_ChannelConfTypeDef sConfig;
ADC_HandleTypeDef    AdcHandle;
__IO uint16_t uhADCxConvertedValue = 0; /* Variable used to get converted value */

void ADC_Config (void);
#endif

#if SCREEN_ENABLE
char SD_Path[4]; /* SD card logical drive path */
static uint32_t uwBmplen = 0;
/* Internal Buffer defined in SDRAM memory */ 
//static uint8_t *uwInternelBuffer = (uint8_t *)0xC0260000;
static uint8_t *uwInternelBuffer = (uint8_t *)(BMP_IMAGE_BUFFER);
TS_StateTypeDef rawTouchState;
GUITouchState touchState;
volatile int32_t pedal_individual=0,  seleccion_menu=MENU_1;
LinkElementMenu	*Flecha_Menu_Izquierda=NULL, *Flecha_Menu_Derecha=NULL;
TIM_HandleTypeDef  htimx;
volatile int32_t seleccion_pedal=0;
/* Private function prototypes -----------------------------------------------*/
void LCD_Config(void);
void Tim3_Patalla_Config (void);
#endif

#if AUDIO_ENABLE
//int32_t Buffer_in[AUDIO_BLOCK_SIZE]={0}, Buffer_out[AUDIO_BLOCK_SIZE]={0}, Buffer_cuentas[AUDIO_BLOCK_HALFSIZE]={0};
int32_t *Buffer_in=(int32_t*)AUDIO_REC_START_ADDR, *Buffer_out=(int32_t*)(AUDIO_PLAY_BUFFER), *Buffer_cuentas=(int32_t*)(AUDIO_CUENTAS_BUFFER);
static int32_t cont_muestras=0, cont_pedales=0;
static uint8_t* AUDIO_RECORD_BUFFER = (uint8_t*)(AUDIO_DELAY_BUFFER+(50000*4)); //Alberga 10 segundos de audio, uso TIM3 (200ms) para copiarlas

volatile bool estado_grabacion=false;
static uint32_t timer_grabacion=0, offset_grabacion=0;
volatile bool screen_refresh_flag=false;
volatile bool block_machine=false;
static uint32_t escritura_sd=0;
#define SEGUNDOS 							20
#define SECTOR_SD_WRITE	256
unsigned int aux_cont_bytes=0;
DIR directorio;
FILINFO	file_info_for_search;
FRESULT	f_result;
uint16_t cantidad_records=0;
#endif

FIL wav_ptr;

void Error_Handler(void);
void SystemClock_Config(void);
void CPU_CACHE_Enable(void);

/* Private typedef -----------------------------------------------------------*/
typedef enum
{
		NONE_STATE				 							= 	0,
		INIT_SCREEN_AUDIO					=	1,
		BUFFER_OFFSET_HALF 		= 	2,
		BUFFER_OFFSET_FULL 		= 	3,
		SCREEN_REFRESH 		 			= 	4,
		INICIAR_GRABACION					=	5,
		GRABACION_TERMINADA	=	6
}machine_states_t;

/* Private define ------------------------------------------------------------*/
/* Para dibujar perillas*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static volatile machine_states_t  machine_state=INIT_SCREEN_AUDIO;

//Declaracion de objeto pedales
PedalElement* Pedales[12];
/* Private functions ---------------------------------------------------------*/

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
		/* Enable the CPU Cache */
		CPU_CACHE_Enable();

		/* STM32F7xx HAL library initialization:
				 - Configure the Flash prefetch, instruction and Data caches
				 - Configure the Systick to generate an interrupt each 1 msec
				 - Set NVIC Group Priority to 4
				 - Global MSP (MCU Support Package) initialization
		 */
		HAL_Init();
		/* Configure the system clock to 200 Mhz */
		SystemClock_Config();
		
		BSP_LED_Init(LED1);
	
		#if SCREEN_ENABLE
		/*Configuracion del Timer para refresco de pantalla*/
		Tim3_Patalla_Config();
		/*Configuracion del display*/
		BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
		BSP_LCD_Init();
		LCD_Config();
//		BSP_SD_Init();
		Storage_Init();
		/*Configuracion del LED*/
		BSP_LED_Init(LED1);
		BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
		/*Inicializo DMA2D para usar el LLconvertline*/
		init_LL_ConvertLine_DMA2D(CM_RGB888);
		#endif

		#if EXTERNAL_WHEEL_ENABLE
		/*Configuracion del ADC*/
		ADC_Config();
		#endif

		/*Inicializo estructuras de pedales*/
		FATFS_LinkDriver(&SD_Driver, SD_Path);
		initPedals();
		InitEfectos();
		
		init_wav_header(AUDIO_RECORD_BUFFER);
		
		escritura_sd=(DEFAULT_AUDIO_IN_FREQ*3*SEGUNDOS)/SECTOR_SD_WRITE;
		
		if ((f_result=f_findfirst(&directorio, &file_info_for_search, "", "*.WAV"))==FR_OK)
		{
				while (file_info_for_search.fname[0]!=0x00)
				{
						if (f_result==FR_OK)
						{
								if (file_info_for_search.fname[2]>='0' && file_info_for_search.fname[2]<='9')
								{
												cantidad_records=((file_info_for_search.fname[1]-48)*10+(file_info_for_search.fname[2]-48))+1;
								}
								else
								{
										cantidad_records=(file_info_for_search.fname[1]-48)+1;
								}
								f_result=f_findnext(&directorio, &file_info_for_search);
						}
				}
		}
		f_closedir(&directorio);
	
		#if SCREEN_ENABLE
		Demo_fondito();
		#endif
		
		
		
		while (1)
		{
				switch (machine_state)
				{
						case NONE_STATE:
						{
								break;
						}
						case INIT_SCREEN_AUDIO:
						{
								/* Start Playback */
								#if AUDIO_ENABLE
								BSP_AUDIO_IN_OUT_Init(INPUT_DEVICE_INPUT_LINE_1, OUTPUT_DEVICE_HEADPHONE, DEFAULT_AUDIO_IN_FREQ, DEFAULT_AUDIO_IN_BIT_RESOLUTION, DEFAULT_AUDIO_IN_CHANNEL_NBR);
								BSP_AUDIO_IN_Record((uint16_t*)Buffer_in, AUDIO_BLOCK_SIZE);
								BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
								BSP_AUDIO_OUT_Play((uint16_t*)Buffer_out, AUDIO_BLOCK_SIZE);
								#endif
							
								machine_state=NONE_STATE;								
								#if SCREEN_ENABLE
							HAL_NVIC_SetPriority(TIM3_IRQn, AUDIO_IN_IRQ_PREPRIO-1, 0);
							if (HAL_TIM_Base_Start_IT(&htimx) != HAL_OK)
								{
										/* Starting Error */
										Error_Handler();
								}
								#endif
								break;
						}
						#if AUDIO_ENABLE
						case BUFFER_OFFSET_HALF:
						{						
								memcpy(Buffer_cuentas, Buffer_in, AUDIO_BLOCK_HALFSIZE*sizeof(int32_t));
								for(cont_muestras=1;cont_muestras<AUDIO_BLOCK_HALFSIZE;cont_muestras+=2)
								{
										if ((Buffer_cuentas[cont_muestras]&0x800000)==0x800000)
										{
												Buffer_cuentas[cont_muestras]=((~Buffer_cuentas[cont_muestras]+1)&0xFFFFFF)*-1;
										}
										for(cont_pedales=11;cont_pedales>=0;cont_pedales--)
										{
												#if SCREEN_ENABLE
												if((Pedales[cont_pedales])->push->push_state==GUI_ON)
												{
														Buffer_cuentas[cont_muestras]=Pedales[cont_pedales]->efecto(Buffer_cuentas[cont_muestras]);
												}
												#endif
										}
										if (Buffer_cuentas[cont_muestras]<0)
										{
												if (estado_grabacion==true)
												{
															AUDIO_RECORD_BUFFER[offset_grabacion]=Buffer_cuentas[cont_muestras]&0xFF;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<8))>>8;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<16))>>16;
															offset_grabacion++;
												}
												Buffer_cuentas[cont_muestras]=(~((-1*Buffer_cuentas[cont_muestras])-1))&0xFFFFFF;
										}
										else
										{
												if (estado_grabacion==true)
												{
															AUDIO_RECORD_BUFFER[offset_grabacion]=Buffer_cuentas[cont_muestras]&0xFF;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<8))>>8;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<16))>>16;
															offset_grabacion++;
												}
										}
								}
								memcpy(Buffer_out, Buffer_cuentas, AUDIO_BLOCK_HALFSIZE*sizeof(int32_t));
								if (machine_state==SCREEN_REFRESH)
								{
										break;
								}
								else
								{
										machine_state=NONE_STATE;
										block_machine=false;
								}
								break;
						}
						/* AUDIO */
						case BUFFER_OFFSET_FULL:
						{
								memcpy(Buffer_cuentas, &Buffer_in[AUDIO_BLOCK_HALFSIZE], AUDIO_BLOCK_HALFSIZE*sizeof(int32_t));
								for(cont_muestras=1;cont_muestras<AUDIO_BLOCK_HALFSIZE;cont_muestras+=2)
									{
											if ((Buffer_cuentas[cont_muestras]&0x800000)==0x800000)
											{
													Buffer_cuentas[cont_muestras]=((~Buffer_cuentas[cont_muestras]+1)&0xFFFFFF)*-1;
											}
											for(cont_pedales=11;cont_pedales>=0;cont_pedales--)
											{
													#if SCREEN_ENABLE
													if((Pedales[cont_pedales])->push->push_state==GUI_ON)
													{
														Buffer_cuentas[cont_muestras]=Pedales[cont_pedales]->efecto(Buffer_cuentas[cont_muestras]);
													}
													#endif
											}
											if (Buffer_cuentas[cont_muestras]<0)
											{
													if (estado_grabacion==true)
													{
															AUDIO_RECORD_BUFFER[offset_grabacion]=Buffer_cuentas[cont_muestras]&0xFF;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<8))>>8;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<16))>>16;
															offset_grabacion++;
													}
													Buffer_cuentas[cont_muestras]=(~((-1*Buffer_cuentas[cont_muestras])-1))&0xFFFFFF;
											}
											else
											{
													if (estado_grabacion==true)
													{
															AUDIO_RECORD_BUFFER[offset_grabacion]=Buffer_cuentas[cont_muestras]&0xFF;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<8))>>8;
															offset_grabacion++;
															AUDIO_RECORD_BUFFER[offset_grabacion]=(Buffer_cuentas[cont_muestras]&(0xFF<<16))>>16;
															offset_grabacion++;
													}
											}
									}
									memcpy(&Buffer_out[AUDIO_BLOCK_HALFSIZE], Buffer_cuentas, AUDIO_BLOCK_HALFSIZE*sizeof(int32_t));
								if (machine_state==SCREEN_REFRESH)
								{
										break;
								}
								else
								{
										machine_state=NONE_STATE;
										block_machine=false;
								}				
								break;
						}
						#endif
						#if SCREEN_ENABLE
						case SCREEN_REFRESH:
						{
							screen_refresh_flag=!screen_refresh_flag;	
							#if EXTERNAL_WHEEL_ENABLE
								if (HAL_ADC_Start_IT(&AdcHandle) != HAL_OK)
								{
										/* Start Conversation Error */
										Error_Handler();
								}
								#endif
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream7_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream4_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ(TIMx_IRQn);
							
								BSP_TS_GetState(&rawTouchState);
								guiUpdateTouch(&rawTouchState, &touchState);
								if(pedal_individual==1)
								{
										if((Pedales[seleccion_pedal]->perilla->perillas[0]->id)!=8)
										{
												guiUpdate(Pedales[seleccion_pedal]->perilla, &touchState);
										}
										handlePushIndividualButton(Pedales[seleccion_pedal], &touchState);
										linkRequestHandlers_pedal_individual(Pedales[seleccion_pedal], &touchState);
								}
								else if(pedal_individual==0)
								{
										PushRequestHandler_menu(Pedales, &touchState);
										linkRequestHandler_menu(Pedales, &touchState);
										linkRequestHandler_Flechas_Menu(Flecha_Menu_Izquierda, &touchState);
										linkRequestHandler_Flechas_Menu(Flecha_Menu_Derecha, &touchState);
								}
								machine_state=NONE_STATE;
								
