codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/Src/main.c
								if (estado_grabacion==true)	
								{
										if (timer_grabacion<SEGUNDOS*10)			/* 50=10s, 5=1s (200ms) ||	*/
										{
											 timer_grabacion++;
										}
										else
										{
												machine_state=GRABACION_TERMINADA;
												break;
										}
								}
								else
								{
										if(BSP_PB_GetState(BUTTON_KEY)==SET)
										{
												machine_state=INICIAR_GRABACION;
												break;
										}
								}
								screen_refresh_flag=!screen_refresh_flag;
								block_machine=false;
								NVIC_EnableIRQ(TIMx_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream4_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream7_IRQn);
								break;
						}
						#endif
						case INICIAR_GRABACION:
						{
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream7_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream4_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ(TIMx_IRQn);
								BSP_LED_On(LED1);
								estado_grabacion=true;
								timer_grabacion=0;
								offset_grabacion=44;
								block_machine=false;
								machine_state=NONE_STATE;
								NVIC_EnableIRQ(TIMx_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream4_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream7_IRQn);
								break;
						}
						case GRABACION_TERMINADA:
						{
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream7_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ((IRQn_Type)DMA2_Stream4_IRQn); //DMA2_Stream4_IRQn
								NVIC_DisableIRQ(TIMx_IRQn);
								
								BSP_AUDIO_OUT_SetVolume(0);
							
								AUDIO_RECORD_BUFFER[4]=(((escritura_sd*SECTOR_SD_WRITE)-44)+36)&(0xFF);//0xF0;
								AUDIO_RECORD_BUFFER[5]=(((escritura_sd*SECTOR_SD_WRITE)-44)&(0xFF<<8))>>8;//0x04;
								AUDIO_RECORD_BUFFER[6]=(((escritura_sd*SECTOR_SD_WRITE)-44)&(0xFF<<16))>>16;
								AUDIO_RECORD_BUFFER[7]=((int32_t)(((int32_t)(escritura_sd*SECTOR_SD_WRITE)-44)&((int32_t)0xFF000000))>>24);//0x00;
								AUDIO_RECORD_BUFFER[40]=(AUDIO_RECORD_BUFFER[4]-36)&(0xFF);
								AUDIO_RECORD_BUFFER[41]=AUDIO_RECORD_BUFFER[5];
								AUDIO_RECORD_BUFFER[42]=AUDIO_RECORD_BUFFER[6];
								AUDIO_RECORD_BUFFER[43]=AUDIO_RECORD_BUFFER[7];
								
//								AUDIO_RECORD_BUFFER[4]=0xD4+36;//0xF0;
//								AUDIO_RECORD_BUFFER[5]=0xFB;//0x04;
//								AUDIO_RECORD_BUFFER[6]=0x13;
//								AUDIO_RECORD_BUFFER[7]=0x00;//0x00;
//								AUDIO_RECORD_BUFFER[40]=0xD4;//0xF0;
//								AUDIO_RECORD_BUFFER[41]=0xFB;//0x04;
//								AUDIO_RECORD_BUFFER[42]=0x13;
//								AUDIO_RECORD_BUFFER[43]=0x00;//0x00;
								
								char nombre_archivo[20];
								
								sprintf(nombre_archivo, "R%d.wav", cantidad_records);
								f_open(&wav_ptr, nombre_archivo, FA_CREATE_ALWAYS | FA_WRITE);
//								for (uint32_t cont_i_bytes=0; cont_i_bytes<5116; cont_i_bytes++)
								for (uint32_t cont_i_bytes=0; cont_i_bytes<escritura_sd; cont_i_bytes++)
								{
										f_write(&wav_ptr, &(AUDIO_RECORD_BUFFER[cont_i_bytes*256]), 256, &aux_cont_bytes);
								}
								
								f_close(&wav_ptr);
								cantidad_records++;
//								f_open(&wav_ptr, "r2.txt", FA_CREATE_ALWAYS | FA_WRITE);
//								sprintf((char*)AUDIO_RECORD_BUFFER, "offset_grabacion=%d, timer_grabacion=%d", offset_grabacion-300, timer_grabacion);
//								f_write(&wav_ptr, AUDIO_RECORD_BUFFER, strlen((char*)AUDIO_RECORD_BUFFER), &aux_cont_bytes);
//								f_close(&wav_ptr);
								
								machine_state=NONE_STATE;
								
								estado_grabacion=false;
								timer_grabacion=0;
								offset_grabacion=0;
								BSP_LED_Off(LED1);
								
								block_machine=false;
								
								BSP_AUDIO_OUT_SetVolume(80);
								
								NVIC_EnableIRQ(TIMx_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream4_IRQn);
								NVIC_EnableIRQ((IRQn_Type)DMA2_Stream7_IRQn);
								break;
						}
						default:
						{
								Error_Handler();
								break;
						}
				}
		}
}

/**
 * @brief  System Clock Configuration
 *         The system Clock is configured as follow :
 *            System Clock source            = PLL (HSE)
 *            SYSCLK(Hz)                     = 200000000
 *            HCLK(Hz)                       = 200000000
 *            AHB Prescaler                  = 1
 *            APB1 Prescaler                 = 4
 *            APB2 Prescaler                 = 2
 *            HSE Frequency(Hz)              = 25000000
 *            PLL_M                          = 25
 *            PLL_N                          = 400
 *            PLL_P                          = 2
 *            PLL_Q                          = 8
 *            VDD(V)                         = 3.3
 *            Main regulator output voltage  = Scale1 mode
 *            Flash Latency(WS)              = 5
 * @param  None
 * @retval None
 */
void SystemClock_Config(void)
{
		HAL_StatusTypeDef ret = HAL_OK;
		RCC_ClkInitTypeDef RCC_ClkInitStruct;
		RCC_OscInitTypeDef RCC_OscInitStruct;

		/* Enable Power Control clock */
		__HAL_RCC_PWR_CLK_ENABLE();

		/* The voltage scaling allows optimizing the power consumption when the device is
			 clocked below the maximum system frequency, to update the voltage scaling value
			 regarding system frequency refer to product datasheet.  */
		__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

		/* Enable HSE Oscillator and activate PLL with HSE as source */
		RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
		RCC_OscInitStruct.HSEState = RCC_HSE_ON;
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
		RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
		RCC_OscInitStruct.PLL.PLLM = 25;
		RCC_OscInitStruct.PLL.PLLN = 400;
		RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
		RCC_OscInitStruct.PLL.PLLQ = 8;
		ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
		ASSERT(ret != HAL_OK);

		/* activate the OverDrive */
		ret = HAL_PWREx_ActivateOverDrive();
		ASSERT(ret != HAL_OK);

		/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
			 clocks dividers */
		RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
		RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
		RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
		RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

		ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
		ASSERT(ret != HAL_OK);
}

/**
 * @brief  CPU L1-Cache enable.
 * @param  None
 * @retval None
 */
void CPU_CACHE_Enable(void)
{
		/* Enable I-Cache */
		SCB_EnableICache(); //Sin esta cache no llega hacer las cuentas de muchos efectos

		/* Enable D-Cache */
		SCB_EnableDCache(); //si usa esta cache me limita la ram muchisimo (no mas de 5kb)
}

void InitEfectos()
{
		delayInit();
		octavadorInit();
		chorusInit();
		phaserInit();
		autowahInit();
		reverbInit();
		distorsionInit();
		flangerInit();
		tremoloInit();
		vibratoInit();
		eqInit();
		ringmodInit();
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
		NVIC_DisableIRQ((IRQn_Type)DMA2_Stream7_IRQn); //DMA2_Stream4_IRQn
		NVIC_DisableIRQ((IRQn_Type)DMA2_Stream4_IRQn); //DMA2_Stream4_IRQn
		NVIC_DisableIRQ(TIMx_IRQn);

		while (1)
		{
				/* LED1 blinks */
				BSP_LED_Toggle(LED1);
				HAL_Delay(20);
		}
}

#if SCREEN_ENABLE
void Tim3_Patalla_Config (void)
{
		/* Time Base configuration */
		htimx.Instance = TIMx; //TIM3 utilizado, APB1 (100MHZ de clock source), APB1=HSE/2

		htimx.Init.Period            = 999;//2000-1 0->0.2s (200ms) , 999(100ms)
		htimx.Init.Prescaler         = 9999;
		htimx.Init.ClockDivision     = 0;
		htimx.Init.CounterMode       = TIM_COUNTERMODE_UP;
		htimx.Init.RepetitionCounter = 0x0;
		htimx.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

