codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/Src/main.c
		if (HAL_TIM_Base_Init(&htimx) != HAL_OK)
		{
				/* Timer initialization Error */
				Error_Handler();
		}
}

void LCD_Config(void)
{
		/* LCD Initialization */
		BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);
		BSP_LCD_LayerDefaultInit(1, LCD_FB_START_ADDRESS+(BSP_LCD_GetXSize()*BSP_LCD_GetYSize()*4));

		/* Enable the LCD */
		BSP_LCD_DisplayOn();

		/* Select the LCD Background Layer  */
		BSP_LCD_SelectLayer(1);

		/* Clear the Background Layer */
		BSP_LCD_Clear(LCD_COLOR_TRANSPARENT);

		/* Select the LCD Foreground Layer  */
		BSP_LCD_SelectLayer(0);

		/* Clear the Foreground Layer */
		BSP_LCD_Clear(LCD_COLOR_TRANSPARENT);

		/* Configure the transparency for foreground and background :
				 Increase the transparency */
		BSP_LCD_SetTransparency(0, 255);
		BSP_LCD_SetTransparency(1, 255);
}

void Demo_fondito(void){
		/* LCD Initialization */
		DrawScreen(MENU_1);
}

void DrawScreen(int num)
{
		char nombre[20];
		sprintf(nombre, "Media/%d.bmp",  num);
		Storage_CheckBitmapFile(nombre, &uwBmplen);
		BSP_LCD_SelectLayer(1);
		Storage_OpenReadFile(uwInternelBuffer, nombre);
		BSP_LCD_DrawBitmap(0, 0, uwInternelBuffer);
		BSP_LCD_SelectLayer(0);
		BSP_LCD_DrawBitmap(0, 0, uwInternelBuffer);
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
		machine_state=SCREEN_REFRESH;
		block_machine=true;
		return;
}
#endif /* SCREEN_ENABLE */

#if AUDIO_ENABLE
/**
 * @brief Manages the DMA Transfer complete interrupt.
 * @param None
 * @retval None
 */
void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
		if (block_machine==false)
		{
				machine_state=BUFFER_OFFSET_FULL;
				block_machine=true;
		}
		return;
}

/**
 * @brief  Manages the DMA Half Transfer complete interrupt.
 * @param  None
 * @retval None
 */
void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
		if (block_machine==false)
		{
				machine_state=BUFFER_OFFSET_HALF;
				block_machine=true;
		}
		return;
}

/**
  * @brief  Manages the DMA full Transfer complete event.
  * @retval None
  */
void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
		return;
}

/**
  * @brief  Manages the DMA Half Transfer complete event.
  * @retval None
  */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{	
		return;
}

#endif /* AUDIO_ENABLE */ 

#if EXTERNAL_WHEEL_ENABLE
void ADC_Config (void)
{
		/*##-1- Configure the ADC peripheral #######################################*/
		AdcHandle.Instance          = ADCx;

		AdcHandle.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV8;//ADC_CLOCKPRESCALER_PCLK_DIV4;
		AdcHandle.Init.Resolution            = ADC_RESOLUTION_12B;
		AdcHandle.Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
		AdcHandle.Init.ContinuousConvMode    = DISABLE;                       /* Continuous mode enabled to have continuous conversion  */
		AdcHandle.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
		AdcHandle.Init.NbrOfDiscConversion   = 0;
		AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;        /* Conversion start trigged at each external event */
		AdcHandle.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
		AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
		AdcHandle.Init.NbrOfConversion       = 1;
		AdcHandle.Init.DMAContinuousRequests = ENABLE;
		AdcHandle.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;

		if (HAL_ADC_Init(&AdcHandle) != HAL_OK)
		{
				Error_Handler();
		}

		/*##-2- Configure ADC regular channel ######################################*/
		sConfig.Channel      = ADCx_CHANNEL;
		sConfig.Rank         = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_480CYCLES;//ADC_SAMPLETIME_3CYCLES; //ADC_SAMPLETIME_480CYCLES
		sConfig.Offset       = 0;

		if (HAL_ADC_ConfigChannel(&AdcHandle, &sConfig) != HAL_OK)
		{
				Error_Handler();
		}
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *AdcHandle)
{
		/* Get the converted value of regular channel */
			DialButtonState *db = (DialButtonState *) (Pedales[PHASER]->perilla->perillas[0]->userData);
			uhADCxConvertedValue = HAL_ADC_GetValue(AdcHandle);
			db->value = (float)(uhADCxConvertedValue/4095.0);
			phaserRate(Pedales[PHASER]->perilla->perillas[0]);
			if(pedal_individual==1 && seleccion_pedal==PHASER)
			{
					Pedales[PHASER]->perilla->perillas[0]->state=GUI_DIRTY;
					Pedales[PHASER]->perilla->perillas[0]->render(Pedales[PHASER]->perilla->perillas[0]);
			}
			if (HAL_ADC_Stop_IT(AdcHandle)!= HAL_OK)
			{
					/* Start Conversation Error */
					Error_Handler();
			}
}
#endif	/*  EXTERNAL_WHEEL_ENABLE */
